src/InformationRegisters/дкл_НоменклатураСкладов/дкл_НоменклатураСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_НоменклатураСкладов</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </resources>
  <resources>
    <name>СопоставленоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>itemId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>extraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>itemName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vendorNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>depth</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/дкл_Статусы/дкл_Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_Статусы</name>
  <enumValues>
    <name>Изменено</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/дкл_НоменклатураСкладов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Результат = Справочники.дкл_НастройкиСкладовЛифтов.ПолучитьРеквизитыSKU(
		ТекущийОбъект.Номенклатура, ТекущийОбъект.Характеристика, ТекущийОбъект.Упаковка);
		
	Если ЗначениеЗаполнено(ТекущийОбъект.ItemID) Тогда     
		// оставляем ItemID каким был...
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, Результат, ,"ItemID");
	Иначе 
		// присваиваем ItemID
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, Результат);		
	КонецЕсли;		
	
	ТекущийОбъект.Статус = Перечисления.дкл_Статусы.Изменено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеНоменклатурыСкладаЛифта");
КонецПроцедуры

#КонецОбласти
